КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ГруппыУпаковки/КонтурЛогистика_ГруппыУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ГруппыУпаковки</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Группа1</name>
  </enumValues>
  <enumValues>
    <name>Группа2</name>
  </enumValues>
  <enumValues>
    <name>Группа3</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ГруппыУпаковки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка = Отсутствует
		ИЛИ Ссылка = ПустаяСсылка() Тогда
		Результат = "-";
	ИначеЕсли Ссылка = Группа1 Тогда
		Результат = "1";
	ИначеЕсли Ссылка = Группа2 Тогда
		Результат = "2";
	ИначеЕсли Ссылка = Группа3 Тогда
		Результат = "3";
	Иначе
		ВызватьИсключение "Для заполнения в xml передано неверное значение группы упаковки: " + Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(ЗначениеИзXDTO) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если Результат = "-" Тогда
		Результат = Отсутствует;
	ИначеЕсли ЗначениеИзXDTO = "1" Тогда
		Результат = Группа1;
	ИначеЕсли ЗначениеИзXDTO = "2" Тогда
		Результат = Группа2;
	ИначеЕсли ЗначениеИзXDTO = "3" Тогда
		Результат = Группа3;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
